---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDir2Generic
source: html/b83fcdd8-8e5f-7521-13f0-e7f4ee939037.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDir2Generic Property

"Top/Exterior Minor Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeTopDir2Generic { get; }
```